#### BuiltInFailures.LoadFailures Members

---

|  |
| --- |
| BuiltInFailures LoadFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures LoadFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCopyHostedLoad | Can't copy Load based on the Host Element. |
| Public property Static member | CannotMirrorHostedLoad | Can't mirror Load based on the Host Element. |
| Public property Static member | CannotMirrorLoad | Can't mirror Load because mirror plane is not perpendicular to sketch plane. |
| Public property Static member | CannotMoveHostedLoad | Can't move Load based on the Host Element. |
| Public property Static member | CannotRotateLoad | Can't rotate Load because rotation axis is not perpendicular to sketch plane. |
| Public property Static member | LineLoadAllZero | Line Load can't have all force components and moment components to be zero. |
| Public property Static member | PointLoadAllZero | Point Load can't have all force components and moment components to be zero. |

# See Also

BuiltInFailures LoadFailures Class

Autodesk.Revit.DB Namespace